<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,416,416" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_269" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 3549" offset="0" size="28392" />
			<output>
				<port id="0" precision="FP32" names="onnx::Sub_480">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3549</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="28392" size="1728" />
			<output>
				<port id="0" precision="FP32" names="model.0.conv.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_5/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_171" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="30120" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Mul_7" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_151">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model.1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="30184" size="18432" />
			<output>
				<port id="0" precision="FP32" names="model.1.conv.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_221" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="48616" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Mul_10" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_154">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="48744" size="4096" />
			<output>
				<port id="0" precision="FP32" names="model.2.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_271" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="52840" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Mul_13" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Split_157">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_301" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="52968" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="Constant_302" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="52976" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Split_14" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="onnx::Concat_158">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="4" precision="FP32" names="input.12">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model.2.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="52992" size="9216" />
			<output>
				<port id="0" precision="FP32" names="model.2.m.0.cv1.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_324" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="62208" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Mul_17" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_162">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model.2.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="62272" size="9216" />
			<output>
				<port id="0" precision="FP32" names="model.2.m.0.cv2.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_374" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="71488" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.20">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Mul_20" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Add_165">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Add_21" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Concat_166">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Concat_22" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="input.24">
					<dim>1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 48, 1, 1" offset="71552" size="6144" />
			<output>
				<port id="0" precision="FP32" names="model.2.cv2.conv.weight">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_426" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="77696" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.28">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Mul_25" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_170">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model.3.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="77824" size="73728" />
			<output>
				<port id="0" precision="FP32" names="model.3.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_26/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_476" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="151552" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_26" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Mul_28" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_173">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model.4.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="151808" size="16384" />
			<output>
				<port id="0" precision="FP32" names="model.4.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_29/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_526" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="168192" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_29" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.36">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Mul_31" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Split_176">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_556" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="52968" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="48" name="Constant_557" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="168448" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Split_32" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="onnx::Concat_177">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="4" precision="FP32" names="input.40">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model.4.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="168464" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.4.m.0.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_579" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="205328" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.44">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Mul_35" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_181">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model.4.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="205456" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.4.m.0.cv2.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_36/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_629" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="242320" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_36" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.48">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Mul_38" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Add_184">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Add_39" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.52">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model.4.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="242448" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.4.m.1.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_40/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_680" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="279312" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_40" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.56">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Mul_42" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_188">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model.4.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="279440" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.4.m.1.cv2.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_43/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_730" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="316304" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.60">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Mul_45" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Add_191">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Add_46" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Concat_192">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Concat_47" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="input.64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model.4.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="316432" size="32768" />
			<output>
				<port id="0" precision="FP32" names="model.4.cv2.conv.weight">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_48/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_782" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="349200" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_48" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.68">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Mul_50" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_196">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model.5.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="349456" size="294912" />
			<output>
				<port id="0" precision="FP32" names="model.5.conv.weight">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_51/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_832" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="644368" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.72">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Mul_53" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_199">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model.6.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1, 1" offset="644880" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model.6.cv1.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_882" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="710416" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_54" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.76">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Mul_56" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Split_202">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_912" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="52968" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="89" name="Constant_913" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="710928" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Split_57" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="onnx::Concat_203">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="4" precision="FP32" names="input.80">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model.6.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="710944" size="147456" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_58/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_935" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="858400" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_58" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.84">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Mul_60" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_207">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="model.6.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="858656" size="147456" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.cv2.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_61/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Reshape_985" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1006112" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_61" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.88">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Mul_63" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Add_210">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Add_64" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.92">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="model.6.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="1006368" size="147456" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.1.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_65/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Reshape_1036" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1153824" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_65" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.96">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Mul_67" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_214">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="model.6.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="1154080" size="147456" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.1.cv2.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_68/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_1086" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1301536" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_68" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.100">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Mul_70" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Add_217">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Add_71" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Concat_218">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Concat_72" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
